Revit 2024 API
BuiltInFailures.LoadFailures.InvalidAreaLoadSketchError Property
 Area Load has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidAreaLoadSketchError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidAreaLoadSketchError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace